---
kind: method
id: M:Autodesk.Revit.DB.CategoryNameMap.ForwardIterator
source: html/8dbe2846-e5c2-709d-55d8-eddb1ca17c6e.htm
---
# Autodesk.Revit.DB.CategoryNameMap.ForwardIterator Method

Retrieve a forward moving iterator to the map.

## Syntax (C#)
```csharp
public virtual CategoryNameMapIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the map.